<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2018/1/31
 * Time: 11:13
 */

namespace app\index\controller;



use think\Controller;

class ReturnCode extends Controller
{
    /*定义错误代码信息*/
    static public $return_code = [
        //操作信息 1000
        '1001' => '操作成功',
        '1002' => '操作失败',
        '1003' => '登录成功',
        '1004' => '登录失败',
        '1005' => '密码错误',
        '1006' => '注册成功',
        '1007' => '注册失败',
        //请求信息 2000
        '2001' => '参数错误',
        '2002' => '请先登陆',
        '2003' => '授权不符',
        //判断信息 4000
        '4000' => '图形验证码错误',
        '4001' => '账号不存在',
        '4002' => '账号被禁用',
        '4003' => '数据操作失败',
        '4004' => '数据不存在',
        '4005' => '手机号已注册',
        '4006' => '证书编号已注册',
        //短信信息 3000
        '3000' => '发送成功',
        '3001' => '发送失败',
        '3002' => '短信已发送,请勿重复点击',
        '3003' => '短信验证码错误',
    ];
}